In [90]:
import os
import pandas as pd

In [91]:
os.chdir("D:\Data Visulization")

In [92]:
data=pd.read_csv("credit_demo (1).csv",na_values=["Missing","NA",'na','n/a','N/A'])

In [93]:
data_train=data.sample(frac=0.8,random_state=200)
data_test=data.drop(data_train.index)

In [94]:
data_train.head()

,ID,LIMIT_BAL,GENDER,EDUCATION,MARRIAGE,AGE,PAY_HISTORY,BILL_AMT,PAY_AMT,default
93,94,50000,MALE,2,1,27.0,-1,1512.333333,962.166667,0
904,907,200000,MALE,1,2,27.0,-1,5489.500000,6346.666667,0
599,601,100000,MALE,2,2,25.0,-1,585.666667,585.666667,0
213,214,20000,FEMALE,1,2,26.0,-1,269.666667,614.500000,0
2157,2161,360000,MALE,2,1,37.0,-1,101140.500000,17417.833330,0

In [95]:
data_train.default.unique()

array([0, 1], dtype=int64)

In [96]:
data_train['default'].value_counts()

0    1597
1     796
Name: default, dtype: int64

In [97]:
data_train['default'].value_counts()/data_train.shape[0]

0    0.667363
1    0.332637
Name: default, dtype: float64

In [98]:
data_train.isnull().sum()

ID              0
LIMIT_BAL       0
GENDER          0
EDUCATION       0
MARRIAGE        0
AGE            16
PAY_HISTORY     0
BILL_AMT        0
PAY_AMT         0
default         0
dtype: int64

In [99]:
data.default.value_counts()

0    2000
1     991
Name: default, dtype: int64

In [100]:
data_train.GENDER.unique()

array(['MALE', 'FEMALE'], dtype=object)

In [101]:
data_train.GENDER.value_counts()

FEMALE    1488
MALE       905
Name: GENDER, dtype: int64

In [102]:
data_train.groupby(['default','GENDER'],as_index=False).size()/data_train.shape[0]

default  GENDER
0        FEMALE    0.434183
         MALE      0.233180
1        FEMALE    0.187631
         MALE      0.145006
dtype: float64

In [103]:
pd.crosstab(data_train.default,data_train.GENDER,margins=True)

GENDER   FEMALE  MALE   All
default
0          1039   558  1597
1           449   347   796
All        1488   905  2393

In [104]:
pd.crosstab(data_train.default,data_train.GENDER,margins=True)/data_train.shape[0]*100

GENDER      FEMALE       MALE         All
default
0        43.418303  23.318011   66.736314
1        18.763059  14.500627   33.263686
All      62.181362  37.818638  100.000000

In [105]:
##relation of all variable with target variable

In [106]:
data.head()

,ID,LIMIT_BAL,GENDER,EDUCATION,MARRIAGE,AGE,PAY_HISTORY,BILL_AMT,PAY_AMT,default
0,1,20000,MALE,3,2,35.0,-1,4486.500000,2354.833333,0
1,2,260000,FEMALE,1,2,51.0,-1,14728.166670,11051.333330,0
2,3,360000,FEMALE,1,1,49.0,-2,0.000000,0.000000,0
3,4,450000,FEMALE,1,1,40.0,-2,4494.166667,3764.833333,1
4,5,50000,FEMALE,3,1,47.0,-1,6701.333333,6594.500000,0

In [107]:
pd.crosstab(data_train.default,data_train.MARRIAGE,margins=True)

MARRIAGE  0     1     2   3   All
default
0         2   848   740   7  1597
1         1   406   377  12   796
All       3  1254  1117  19  2393

In [108]:
pd.crosstab(data_train.default,data_train.EDUCATION,margins=True)

EDUCATION  0     1    2    3  4  5  6   All
default
0          2   830  553  196  6  7  3  1597
1          0   222  425  149  0  0  0   796
All        2  1052  978  345  6  7  3  2393

In [109]:
pd.crosstab(data_train.default,data_train.PAY_HISTORY,margins=True)

PAY_HISTORY   -2    -1    2   3   4  5  6   7  8   All
default
0              1  1589    0   0   0  1  0   6  0  1597
1            121     0  555  70  14  6  7  21  2   796
All          122  1589  555  70  14  7  7  27  2  2393

In [ ]:
data_train.isnull().sum()

ID              0
LIMIT_BAL       0
GENDER          0
EDUCATION       0
MARRIAGE        0
AGE            16
PAY_HISTORY     0
BILL_AMT        0
PAY_AMT         0
default         0
dtype: int64

In [ ]:
data_train['AGE']=data_train['AGE'].fillna(data_train['AGE'].mean())

In [ ]:
data_train.describe()

In [ ]:
data_train.loc[(data_train['AGE']>55)]

In [ ]:
data_train.loc[(data_train['AGE']>70)]

In [ ]:
avg=data['AGE'].mean()
avg

In [ ]:
data_train.loc[(data_train['AGE']>70),'AGE']

In [ ]:
data_train.loc[(data_train['AGE']>70),'AGE']=avg

In [ ]:
data_train.describe()

In [ ]:
def get_limit(x):
    if 0<x<80000:
        return "Low"
    elif 80000<=x<170000:
        return "Medium"
    else:
        return "High"

In [ ]:
data_train['limit']=data_train['LIMIT_BAL'].map(get_limit)

In [ ]:
data_train.head()

In [ ]:
data_train.loc[(data_train['LIMIT_BAL']<80000)]

In [ ]:
data_train.loc[(data_train['LIMIT_BAL']>=80000)&(data_train['LIMIT_BAL']<170000)].head()

In [ ]:
pd.crosstab(data_train.default,data_train.limit,margins=True)/data_train.shape[0]*100

In [ ]:
def get_age(x):
    if 0<x<29:
        return "between 0-29"
    elif 29<=x<36:
        return "between 29-36"
    elif 36<=x<=42:
        return "between 36-42"
    else:
        return "Above 42"

In [72]:
data_train['age_range']=data_train['AGE'].map(get_age)

In [73]:
pd.crosstab(data_train.default,data_train.age_range,margins=True)/data_train.shape[0]*100

age_range   Above 42  between 0-29  between 29-36  between 36-42         All
default
0          15.963226     11.993314      20.518178      18.261596   66.736314
1           8.650230      8.817384       8.232344       7.563728   33.263686
All        24.613456     20.810698      28.750522      25.825324  100.000000

In [74]:
data_train.head()

,ID,LIMIT_BAL,GENDER,EDUCATION,MARRIAGE,AGE,PAY_HISTORY,BILL_AMT,PAY_AMT,default,limit,age_range
93,94,50000,MALE,2,1,27.0,-1,1512.333333,962.166667,0,Low,between 0-29
904,907,200000,MALE,1,2,27.0,-1,5489.500000,6346.666667,0,High,between 0-29
599,601,100000,MALE,2,2,25.0,-1,585.666667,585.666667,0,Medium,between 0-29
213,214,20000,FEMALE,1,2,26.0,-1,269.666667,614.500000,0,Low,between 0-29
2157,2161,360000,MALE,2,1,37.0,-1,101140.500000,17417.833330,0,High,between 36-42

In [75]:
def get_bill(x):
    if x<1352:
        return "low"
    elif 1352<=x<4557:
        return "Medium"
    else:
        return "High"

In [76]:
data_train['bill']=data_train['BILL_AMT'].map(get_bill)

In [77]:
pd.crosstab(data_train.default,data_train.bill,margins=True)/data_train.shape[0]*100

bill          High     Medium        low         All
default
0        24.780610  20.936064  21.019641   66.736314
1        25.240284   4.053489   3.969912   33.263686
All      50.020894  24.989553  24.989553  100.000000

In [78]:
def pay_amt(x):
    if x<833:
        return "low"
    elif 833<=x<2066:
        return "Medium"
    else:
        return "High"

In [79]:
data_train['Pay_cat']=data_train['PAY_AMT'].map(pay_amt)

In [83]:
pd.crosstab(data_train.default,data_train.Pay_cat,margins=True)/data_train.shape[0]*100

Pay_cat       High     Medium        low         All
default
0        38.487254  12.996239  15.252821   66.736314
1        11.533640  12.244045   9.486001   33.263686
All      50.020894  25.240284  24.738822  100.000000

In [89]:
data_train.describe()

ValueError: Cannot describe a DataFrame without columns

In [85]:
data_train.drop(data_train.query("EDUCATION==0|EDUCATION>=4"),axis=1,inplace=True)

Empty DataFrame
Columns: []
Index: [93, 904, 599, 213, 2157]